import msgspec

WEAPONS_1 = [
    "Огненный"
    "Водяной"
    "Ветреный"
    "Земляной"
    "Агрессивный"
    "Пожилой"
    "Постмодернистский"
    "Рассекающий"
    "Бешеный"
    "Печальный"
    "Крутой"
    "Пафосный"
    "Особенный"
    "Легендарный"
    "Четкий"
    "Кибернетический"
    "Метафорический"
    "Бракованный"
    "Перманентный"
    "Красивый"
    "Аномальный"
    "Безобразный"
    "Блестящий"
    "Бывалый"
    "Жгучий"
    "Жуткий"
    "Поношенный"
    "Колючий"
    "Ловкий"
    "Ректальный"
]


WEAPONS_2 = [
    "Меч"
    "Секира"
    "Ятаган"
    "Булава"
    "Клинок"
    "Нунчаки"
    "Кирпич"
    "Фалоиммитатор"
    "Носок"
    "Праща"
    "Сковородка"
    "Бан"
    "Пистолет"
    "Палец"
    "Палка"
    "Светильник"
    "Рубанок"
    "Топор"
    "Дубинка"
    "Полотенце"
    "Скалка"
    "Тапок"
    "Посох"
    "Палица"
    "Кинжал"
    "Табуретка"
    "Кочерга"
    "Ятаган"
    "Xiaomi"
]


WEAPONS_3 = [
    "Страданий"
    "Хаоса"
    "Бомжа"
    "Сантехника"
    "Самурая"
    "Монаха"
    "Мастера Подземелья"
    "Ричи"
    "Вофа"
    "Защитника"
    "Смотрителя"
    "Черного рыцаря"
    "Скверны"
    "Берсерка"
    "Пехотинца"
]

class SWORDS(msgspec.Struct):
    first:  list = WEAPONS_1
    second: list = WEAPONS_2
    third:  list = WEAPONS_3


BOWS_1 = [
    "Огненный"
]
BOWS_2 = [
    "Лук"
]
BOWS_3 = WEAPONS_3
class BOWS(msgspec.Struct):
    first: list = BOWS_1
    second:list = BOWS_2
    third: list = BOWS_3


ARMOR_1 = [
    "Стеклянная"
    "Пожилая"
    "Оловянная"
    "Железная"
    "Стальная"
    "Голографическая"
    "Постмодернистская"
    "Запрещенная"
    "Северная"
    "Амортизирующая"
    "Ударопрочная"
    "Армированная"
    "Прочная"
    "Соловьиная"
    "Эргономичная"
    "Полицейская"
    "Ультратонкая"
    "Поношенная"
    "Практичная"
    "Эксперементальная"
]


ARMOR_2 = [
    "Кирасса"
    "Броня"
    "Защита"
    "Форма"
    "Куртка"
]


ARMOR_3 = [
    "Безымянного рыцаря"
    "Рыцаря-раба"
    "Школы Кота"
    "Заката" 
    "Нетраннера"
    "Мудреца"
    "Полицейского"
    "Могильщика"
    "Посвященного"
    "Чародея"
    "Офицера"
    "Из Каэр Морхена"
    "Ласточки"
    "Техника"
    "Кочевника"
    "Головореза"
    "Братства Стали"
    "Рейдера"
    "Убежища"
    "Инженера"
    "Ополченца"
    "Убийцы"
    "Провокатора"
    "Гангстера"
    "Синта"
    "Самурая"
    "Клана Ворона"
    "Незримых"
    "Наставника"
    "Тора"
]

class ARMOR(msgspec.Struct):
    first:  list = ARMOR_1
    seconds:list = ARMOR_2
    third:  list = ARMOR_3
